app/controllers/emails_controller.rb

INSERT INTO "emails" ("object", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    @email = Email.new(object: Faker::JapaneseMedia::OnePiece.sea, body: Faker::Lorem.paragraph)

    respond_to do |format|
      if @email.save